## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_postgresql_database.confluence
  * azurerm_postgresql_database.crowd
  * azurerm_postgresql_database.jira
  * azurerm_postgresql_server.atlassian-server
* Update
  * azurerm_application_gateway.ag
* Delete
  * azurerm_postgresql_database.confluence-prd
  * azurerm_postgresql_database.crowd-prd
  * azurerm_postgresql_database.jira-prd
  * azurerm_postgresql_server.atlassian-preprod-server




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway"
        name                              = "atlasssian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_postgresql_database.confluence will be created
  + resource "azurerm_postgresql_database" "confluence" {
      + charset             = "UTF8"
      + collation           = "English_United States.1252"
      + id                  = (known after apply)
      + name                = "confluence-nonprod"
      + resource_group_name = "atlassian-nonprod-rg"
      + server_name         = "atlassian-nonprod-server"
    }

  # azurerm_postgresql_database.confluence-prd will be destroyed
  # (because azurerm_postgresql_database.confluence-prd is not in configuration)
  - resource "azurerm_postgresql_database" "confluence-prd" {
      - charset             = "UTF8" -> null
      - collation           = "English_United States.1252" -> null
      - id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-preprod-server/databases/confluence-prd" -> null
      - name                = "confluence-prd" -> null
      - resource_group_name = "atlassian-nonprod-rg" -> null
      - server_name         = "atlassian-preprod-server" -> null
    }

  # azurerm_postgresql_database.crowd will be created
  + resource "azurerm_postgresql_database" "crowd" {
      + charset             = "UTF8"
      + collation           = "English_United States.1252"
      + id                  = (known after apply)
      + name                = "crowd-nonprod"
      + resource_group_name = "atlassian-nonprod-rg"
      + server_name         = "atlassian-nonprod-server"
    }

  # azurerm_postgresql_database.crowd-prd will be destroyed
  # (because azurerm_postgresql_database.crowd-prd is not in configuration)
  - resource "azurerm_postgresql_database" "crowd-prd" {
      - charset             = "UTF8" -> null
      - collation           = "English_United States.1252" -> null
      - id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-preprod-server/databases/crowd-prd" -> null
      - name                = "crowd-prd" -> null
      - resource_group_name = "atlassian-nonprod-rg" -> null
      - server_name         = "atlassian-preprod-server" -> null
    }

  # azurerm_postgresql_database.jira will be created
  + resource "azurerm_postgresql_database" "jira" {
      + charset             = "UTF8"
      + collation           = "English_United States.1252"
      + id                  = (known after apply)
      + name                = "jira-nonprod"
      + resource_group_name = "atlassian-nonprod-rg"
      + server_name         = "atlassian-nonprod-server"
    }

  # azurerm_postgresql_database.jira-prd will be destroyed
  # (because azurerm_postgresql_database.jira-prd is not in configuration)
  - resource "azurerm_postgresql_database" "jira-prd" {
      - charset             = "UTF8" -> null
      - collation           = "English_United States.1252" -> null
      - id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-preprod-server/databases/jira-prd" -> null
      - name                = "jira-prd" -> null
      - resource_group_name = "atlassian-nonprod-rg" -> null
      - server_name         = "atlassian-preprod-server" -> null
    }

  # azurerm_postgresql_server.atlassian-preprod-server will be destroyed
  # (because azurerm_postgresql_server.atlassian-preprod-server is not in configuration)
  - resource "azurerm_postgresql_server" "atlassian-preprod-server" {
      - administrator_login               = (sensitive value) -> null
      - administrator_login_password      = (sensitive value) -> null
      - auto_grow_enabled                 = true -> null
      - backup_retention_days             = 7 -> null
      - create_mode                       = "Default" -> null
      - fqdn                              = "atlassian-preprod-server.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled      = false -> null
      - id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-preprod-server" -> null
      - infrastructure_encryption_enabled = false -> null
      - location                          = "uksouth" -> null
      - name                              = "atlassian-preprod-server" -> null
      - public_network_access_enabled     = true -> null
      - resource_group_name               = "atlassian-nonprod-rg" -> null
      - sku_name                          = "B_Gen5_2" -> null
      - ssl_enforcement_enabled           = true -> null
      - ssl_minimal_tls_version_enforced  = "TLS1_2" -> null
      - storage_mb                        = 51200 -> null
      - tags                              = {
          - "application"  = "atlassian"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "environment"  = "staging"
        } -> null
      - version                           = "11" -> null
    }

  # azurerm_postgresql_server.atlassian-server will be created
  + resource "azurerm_postgresql_server" "atlassian-server" {
      + administrator_login              = (sensitive value)
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = (known after apply)
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = false
      + id                               = (known after apply)
      + location                         = "uksouth"
      + name                             = "atlassian-nonprod-server"
      + public_network_access_enabled    = true
      + resource_group_name              = "atlassian-nonprod-rg"
      + sku_name                         = "B_Gen5_2"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 51200
      + version                          = "11"
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":14,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->